#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.vpc: Refreshing state... [id=vpc-0c3970476ecdb2e4a]
data.aws_iam_policy_document.assume_role: Reading...
aws_eip.eip_01: Refreshing state... [id=eipalloc-0565168157dadac7c]
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
aws_eip.eip_02: Refreshing state... [id=eipalloc-09780e77a71b3d4da]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231012054428752100000002]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231012054428766900000003]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231012054428818300000004]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231012054428832300000005]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231012054428654900000001]
aws_iam_role_policy.iam_role_policy_s3: Refreshing state... [id=earth-dev-eks-node-group-role:s3_policy]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-03f46dc43d3a787d1]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0f3ccf88a7a586476]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0d72a8c7a5c0b7ca8]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0f1cc43ca0415d6cc]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-036e152ae885c8c75]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0de6cd197beec9dbd]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-09aa00ad2612df807]
aws_route_table.public_route_table: Refreshing state... [id=rtb-02308636a65b501eb]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0143297e13dad5940]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0d19ab92874661f9b]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0748ad830eafed851]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-0ce47c3ff9c3198f2]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-0a3418ba91f6d3c88]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0536bcc6c2c476e95]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-0fde598cb517f7de4]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.app_node_group is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "app_node_group" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:318374019075:nodegroup/earth-dev/app-node-group/2ec59138-8126-6dfe-610f-d9c9a3184973" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "earth-dev:app-node-group" -> (known after apply)
      ~ instance_types         = [] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "ami-0e581dc33f688a5df" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-app-node-group-2ec59138-8126-6dfe-610f-d9c9a3184973"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      + version                = (known after apply)
        # (5 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-074722705350fe8a1" -> (known after apply)
            name    = "mountpoint-s3"
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*